Revit 2027 API
BuiltInFailures.ElectricalFailures.NoPanelCircuitBecomeASpare Property
 Circuit [Circuit Name] in the model has become a spare because all connected elements have been disconnected. Click Delete if you want to remove the Spare, click OK to preserve the Spare..
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoPanelCircuitBecomeASpare { get; }
Public Shared ReadOnly Property NoPanelCircuitBecomeASpare As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoPanelCircuitBecomeASpare {
	FailureDefinitionId^ get ();
}
static member NoPanelCircuitBecomeASpare : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace